In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('ai-03-quiz.csv',
                 delimiter=',', skiprows=1, header=0)
print(df.shape)
print(df.dtypes)
display(df.head())

(60, 3)
Team     object
Pref     object
Time    float64
dtype: object

  Team     Pref   Time
0    A  Saitama  176.2
1    A  Saitama  179.1
2    C    Chiba  180.0
3    A    Tokyo  176.5
4    A    Tokyo  179.7

In [4]:
print("Number of players:", df.shape[0])

Number of players: 60

In [6]:
print(df['Pref'].value_counts())

Tokyo       19
Saitama     15
Kanagawa    14
Chiba       12
Name: Pref, dtype: int64

In [7]:
print(df['Time'].mean())

179.94333333333333

In [9]:
df_pref_team = df.pivot_table('Time', index='Team', columns='Pref',
                                 aggfunc=np.average)
display(df_pref_team)
print(df_pref_team.at['B', 'Kanagawa'])

Pref    Chiba    Kanagawa     Saitama       Tokyo
Team
A     180.875  179.600000  178.500000  179.583333
B     180.900  178.757143  179.571429  181.525000
C     182.140  180.366667  180.250000  179.766667

178.7571428571429